cfd_interfaces/openfoam/examples/infinite_wing/system/controlDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

libs            ("libOpenFOAM.so" "libfvOptions.so" "libActuatorLine.so" );
application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         20.0;
deltaT          0.01;
writeControl    adjustable;
writeInterval   5.0;
purgeWrite      0;
writeFormat     binary;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           1.0;

