cfd_interfaces/openfoam/examples/infinite_wing/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            false;
addLayers       false;

geometry
{
    wingBox
    {
        type box;
        min  (-0.5 -0.5 -2.1);
        max  ( 0.5  0.5  2.1);
    }

    wakeBox
    {
        type box;
        min  (-1.0 -0.6 -2.5);
        max  ( 10.0  0.6 2.5);
    }
}

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 10;

    features ();

    refinementSurfaces{}

    resolveFeatureAngle 30;

    refinementRegions
    {
        wingBox
        {
            mode inside;
            levels ((1.0 3));
        }

        wakeBox
        {
            mode inside;
            levels ((1.0 2));
        }
    }

    locationInMesh (0.25 0 0.0);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;

    layers{}

    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    #includeEtc "caseDicts/meshQualityDict"
}

mergeTolerance 1e-6;